In [22]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [23]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [24]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [25]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city             date   fare        ride_id
0  Lake Jonathanshire  1/14/2019 10:14  13.83  5739410000000
1  South Michelleport   3/4/2019 18:24  30.24  2343910000000
2  Port Samanthamouth   2/24/2019 4:29  33.44  2005070000000
3          Rodneyfort  2/10/2019 23:22  23.44  5149250000000
4          South Jack    3/6/2019 4:28  34.58  3908450000000
5        South Latoya  3/11/2019 12:26   9.52  1995000000000
6       New Paulville  2/27/2019 11:17  43.25   793208000000
7        Simpsonburgh   4/26/2019 0:43  35.98   111954000000
8     South Karenland    1/8/2019 3:28  35.09  7995620000000
9       North Jasmine    3/9/2019 6:26  42.81  5327640000000

In [26]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [27]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [28]:
#get the data types of each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [29]:
#get the unique vaules of teh type of city
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [30]:
#get the number of dtat points from teh urban cities
sum(city_data_df['type']=='Urban')

66

In [31]:
sum(city_data_df['type']=='Suburban')

36

In [32]:
sum(city_data_df['type']=='Rural')

18

In [33]:
#get the columns and rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [34]:
#the amount of null values 
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [35]:
#get dataypes of each column so we know if we can perform amthematical calculations
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [41]:
#combine the data into a singel data sheet
pyber_data_df=pd.merge(ride_data_df, city_data_df, how='left',on=['city', 'city'] )
#display the dataframe
pyber_data_df.head(20)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410000000,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343910000000,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005070000000,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149250000000,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908450000000,46,Urban
5,South Latoya,3/11/2019 12:26,9.52,1995000000000,10,Urban
6,New Paulville,2/27/2019 11:17,43.25,793208000000,44,Urban
7,Simpsonburgh,4/26/2019 0:43,35.98,111954000000,21,Urban
8,South Karenland,1/8/2019 3:28,35.09,7995620000000,4,Urban
9,North Jasmine,3/9/2019 6:26,42.81,5327640000000,33,Urban
10,New Kimberlyborough,2/7/2019 1:10,9.34,7992780000000,33,Urban
11,West Angela,1/12/2019 1:45,26.86,4820050000000,48,Urban
12,Rodneyfort,3/2/2019 18:03,44.26,2494060000000,34,Urban
13,West Angela,1/10/2019 12:17,12.74,2108720000000,48,Urban
14,Roberthaven,5/4/2019 14:48,25.66,1026200000000,47,Urban
15,North Jason,3/28/2019 22:28,9.19,7007020000000,6,Urban
16,Williamsview,1/3/2019 16:19,18.93,1979490000000,46,Urban
17,Leahton,2/26/2019 18:42,8.85,6966670000000,17,Urban
18,West Anthony,3/6/2019 2:27,10.02,9396760000000,70,Urban
19,New Kimberlyborough,4/25/2019 22:58,29.67,4823570000000,33,Urban

In [42]:
#combine the data into a singel data sheet don't use how=right b/c you need to compare first column to rest of data
#pyber_data_df=pd.merge(ride_data_df, city_data_df, how='right',on=['city', 'city'] )
#display the dataframe
#pyber_data_df.head(20)